In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [16]:
df = pd.read_csv('/Users/dileepsathyan/Documents/GitHub/datasets/monthly_champagne_sales.csv')

In [17]:
df.head()

     Month  Sales
0  1964-01   2815
1  1964-02   2672
2  1964-03   2755
3  1964-04   2721
4  1964-05   2946

In [18]:
df['Month'] = pd.to_datetime(df['Month'])
df.head()

       Month  Sales
0 1964-01-01   2815
1 1964-02-01   2672
2 1964-03-01   2755
3 1964-04-01   2721
4 1964-05-01   2946

In [20]:
df = df.set_index('Month')
df.head()

            Sales
Month
1964-01-01   2815
1964-02-01   2672
1964-03-01   2755
1964-04-01   2721
1964-05-01   2946